/*********************************************************************************************
* 文件：MP-4.h
* 作者：Lixm 2017.10.17
* 说明：可燃气体传感器驱动代码头文件  
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 宏条件编译
*********************************************************************************************/
#ifndef __MP_4_H__
#define __MP_4_H__

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "extend.h"
/**ADC1 GPIO Configuration
PC0     ------> ADC1_INP10
*/
/* ADC及引脚 定义 */
#define ADC_ADCX_CHY_GPIO_PORT              GPIOC
#define ADC_ADCX_CHY_GPIO_PIN               GPIO_PIN_0
#define ADC_ADCX_CHY_GPIO_CLK_ENABLE()      do{ __HAL_RCC_GPIOC_CLK_ENABLE(); }while(0)         /* 时钟使能 */

#define ADC_ADCX                            ADC1
#define ADC_ADCX_CHY                        ADC_CHANNEL_10                                      /* 通道Y, 0 <= Y <= 19 */ 
#define ADC_ADCX_CHY_CLK_ENABLE()           do{ __HAL_RCC_ADC12_CLK_ENABLE(); }while(0)         /* ADC1 时钟使能 */
/*********************************************************************************************
* 内部原型函数
*********************************************************************************************/
void combustiblegas_init(void);                                 //可燃气体传感器初始化
unsigned int get_combustiblegas_data(void);

#endif /*__MP_4_H__*/

