/*********************************************************************************************
* 文件：Relay.c
* 作者：Lixm 2017.10.17
* 说明：门锁驱动代码
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "lock.h"

/*********************************************************************************************
* 名称：lock_init
* 功能：门锁初始化函数
* 参数：无
* 返回：无
* 修改：无
* 注释：无
*******************************************************************************************/
void lock_init(void)
{
  GPIO_InitTypeDef gpio_init_struct={0};
  LOCK_GPIO_CLK_ENABLE();                                 /* 时钟使能 */
  
  gpio_init_struct.Pin = LOCK_GPIO_PIN;                   /* LED引脚 */
  gpio_init_struct.Mode = GPIO_MODE_OUTPUT_PP;            /* 推挽输出 */
  gpio_init_struct.Pull = GPIO_PULLDOWN;                  /* 下拉 */
  gpio_init_struct.Speed = GPIO_SPEED_FREQ_MEDIUM;        /* 中速 */
  HAL_GPIO_Init(LOCK_GPIO_PORT, &gpio_init_struct);       /* 初始化引脚 */  
  
  LOCK_CLOSE;
}
