/*********************************************************************************************
* 文件：Infrared.c
* 作者：Lixm 2017.10.17
* 说明：人体红外驱动代码
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "Infrared.h"

/*********************************************************************************************
* 名称：infrared_init()
* 功能：人体红外传感器初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void infrared_init(void)
{
  GPIO_InitTypeDef gpio_init_struct={0};
  __HAL_RCC_GPIOB_CLK_ENABLE();                           //开启人体红外相关的GPIO外设时钟

  gpio_init_struct.Pin = GPIO_PIN_11;                     //选择要控制的GPIO引脚
  gpio_init_struct.Mode = GPIO_MODE_INPUT;                //设置引脚模式为输入模式
  gpio_init_struct.Pull = GPIO_PULLDOWN;                  //设置引脚为下拉模式
  gpio_init_struct.Speed = GPIO_SPEED_FREQ_MEDIUM;        //设置引脚速率
  HAL_GPIO_Init(GPIOB, &gpio_init_struct);                //初始化GPIO配置
}

/*********************************************************************************************
* 名称：unsigned char get_infrared_status(void)
* 功能：获取人体红外传感器状态
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
unsigned char get_infrared_status(void)
{ 
  if(HAL_GPIO_ReadPin(GPIOB,GPIO_PIN_11))                   //判断人体红外引脚状态
    return 1;
  else
    return 0;
}